       IDENTIFICATION DIVISION. 
       PROGRAM-ID. CALCULATE
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.

       DISPLAY "HELLO WORLD".

       STOP RUN.
       